
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Приход Приход
	Движения.Приход.Записывать = Истина;
	Движение = Движения.Приход.Добавить();
	Движение.Период = Дата;
	Движение.Дата = Дата;
	Движение.Кошелек = Кошелек;
	Движение.ВидДохода = ВидДохода;
	Движение.Сумма = Сумма;

	// регистр Деньги Приход
	Движения.Деньги.Записывать = Истина;
	Движение = Движения.Деньги.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Кошелек = Кошелек;
	Движение.Дата = Дата;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
