
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВыпискиИзБанков Приход
	Движения.ВыпискиИзБанков.Записывать = Истина;
	Движение = Движения.ВыпискиИзБанков.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Дата = Дата;
	Движение.НомерКарты = НомерКарты;
	Движение.Город = ГородСовершения;
	Движение.Описание = Описание;
	Движение.Сумма = СуммаВВалютеСчета;

	// регистр ВыпискиИзБанков Расход
	Движения.ВыпискиИзБанков.Записывать = Истина;
	Движение = Движения.ВыпискиИзБанков.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Дата = Дата;
	Движение.НомерКарты = Номер;
	Движение.Город = ГородСовершения;
	Движение.Описание = Описание;
	Движение.Сумма = СуммаВВалютеСчета;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
